esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
/*
 * Author: Ernst Sikora
 *
 * Created on: December 26, 2025
 */

#include <stdio.h>
#include <inttypes.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_chip_info.h"
#include "esp_flash.h"
#include "esp_system.h"
#include "esp_log.h"
#include "esp_random.h"

#include "bsp/esp32_p4_wifi6_touch_lcd_7b.h"
#include "lvgl.h"
#include "iot_button.h"
#include "button_gpio.h"

// Define colors manually
#define LV_COLOR_RED     lv_color_make(0xFF, 0x00, 0x00)
#define LV_COLOR_GREEN   lv_color_make(0x00, 0xFF, 0x00)
#define LV_COLOR_BLUE    lv_color_make(0x00, 0x00, 0xFF)
#define LV_COLOR_WHITE   lv_color_make(0xFF, 0xFF, 0xFF)
#define LV_COLOR_BLACK   lv_color_make(0x00, 0x00, 0x00)
#define LV_COLOR_GRAY    lv_color_make(0x80, 0x80, 0x80)
#define LV_COLOR_YELLOW  lv_color_make(0xFF, 0xFF, 0x00)
#define LV_COLOR_ORANGE  lv_color_make(0xFF, 0xA5, 0x00)

// WWTBAM Color Palette
#define WWTBAM_BG            lv_color_make(0x00, 0x00, 0x33)   // deep navy
#define WWTBAM_GOLD          lv_color_make(0xFF, 0xD7, 0x00)   // gold
#define WWTBAM_BLUE          lv_color_make(0x00, 0x33, 0x99)   // bright blue
#define WWTBAM_BLUE_DARK     lv_color_make(0x00, 0x22, 0x66)
#define WWTBAM_WHITE         lv_color_make(0xFF, 0xFF, 0xFF)
#define WWTBAM_ORANGE_DARK   lv_color_make(0xE6, 0x80, 0x00)
#define WWTBAM_GREEN_DARK   lv_color_make(0x00, 0x66, 0x00)   // deeper green

#define WWTBAM_HIGHLIGHT_BG     lv_color_make(0x33, 0x33, 0x99)   // glowing blue
#define WWTBAM_HIGHLIGHT_BORDER lv_color_make(0x33, 0x99, 0xFF)   // electric blue


// === Quiz data structures ====================================================

typedef struct {
    const char *question;
    const char *answer_a;
    const char *answer_b;
    const char *answer_c;
    char correct;            // 'A', 'B', 'C'
    char difficulty;         // 'L', 'M', 'H'
    const char *correct_reaction;
    const char *wrong_reaction;
} quiz_question_t;

quiz_question_t quiz_questions[] = {
    {
        "Was ist die Hauptstadt von Frankreich?",
        "Paris",
        "London",
        "Berlin",
        'A',
        'L',
        "Richtig! Paris ist die Hauptstadt von Frankreich.",
        "Falsch! Die richtige Antwort ist Paris."
    },
    {
        "Welcher Planet ist als der Rote Planet bekannt?",
        "Venus",
        "Mars",
        "Jupiter",
        'B',
        'L',
        "Richtig! Mars ist der Rote Planet.",
        "Falsch! Mars ist der Rote Planet."
    },
    {
        "Was ist 2 + 2?",
        "3",
        "4",
        "5",
        'B',
        'L',
        "Richtig! 2 + 2 = 4.",
        "Falsch! 2 + 2 = 4."
    },
    {
        "Wer schrieb 'Romeo und Julia'?",
        "Charles Dickens",
        "William Shakespeare",
        "Jane Austen",
        'B',
        'M',
        "Richtig! William Shakespeare schrieb 'Romeo und Julia'.",
        "Falsch! William Shakespeare schrieb 'Romeo und Julia'."
    },
    {
        "Welcher ist der größte Ozean der Erde?",
        "Atlantischer Ozean",
        "Indischer Ozean",
        "Pazifischer Ozean",
        'C',
        'M',
        "Richtig! Der Pazifische Ozean ist der größte.",
        "Falsch! Der Pazifische Ozean ist der größte."
    },
    {
        "In welchem Jahr endete der Zweite Weltkrieg?",
        "1944",
        "1945",
        "1946",
        'B',
        'M',
        "Richtig! Der Zweite Weltkrieg endete 1945.",
        "Falsch! Der Zweite Weltkrieg endete 1945."
    },
    {
        "Was ist das chemische Symbol für Gold?",
        "Go",
        "Gd",
        "Au",
        'C',
        'H',
        "Richtig! Au ist das chemische Symbol für Gold.",
        "Falsch! Au ist das chemische Symbol für Gold."
    },
    {
        "Welches Element hat die Ordnungszahl 1?",
        "Helium",
        "Wasserstoff",
        "Lithium",
        'B',
        'H',
        "Richtig! Wasserstoff hat die Ordnungszahl 1.",
        "Falsch! Wasserstoff hat die Ordnungszahl 1."
    },
    {
        "Wie lautet die Quadratwurzel von 144?",
        "12",
        "14",
        "16",
        'A',
        'H',
        "Richtig! Die Quadratwurzel von 144 ist 12.",
        "Falsch! Die Quadratwurzel von 144 ist 12."
    },
    {
        "Wer malte die Mona Lisa?",
        "Vincent van Gogh",
        "Leonardo da Vinci",
        "Pablo Picasso",
        'B',
        'H',
        "Richtig! Leonardo da Vinci malte die Mona Lisa.",
        "Falsch! Leonardo da Vinci malte die Mona Lisa."
    }
};

#define NUM_QUIZ_QUESTIONS (sizeof(quiz_questions) / sizeof(quiz_question_t))

typedef enum {
    QUIZ_STATE_IDLE,
    QUIZ_STATE_SHOWING_QUESTION,
    QUIZ_STATE_WAITING_ANSWER,
    QUIZ_STATE_SHOWING_REACTION,
    QUIZ_STATE_WINNER,
    QUIZ_STATE_FAIL,
    QUIZ_STATE_SHUTDOWN_PROMPT
} quiz_state_t;

// === Global quiz state =======================================================

static quiz_state_t quiz_state = QUIZ_STATE_IDLE;
static int score = 0;
static int tries = 0;
static bool used_questions[NUM_QUIZ_QUESTIONS] = {false};
static int current_question_index = -1;
static int timer_remaining = 0;
static char user_answer = 0;
static lv_timer_t *quiz_timer = NULL;

// === Button information ======================================================

typedef struct {
    int gpio_num;
    lv_color_t color;
    lv_obj_t *btn_obj;       // LVGL button widget
    button_handle_t handle;  // physical button
    bool is_pressed;
} button_info_t;

#define NUM_BUTTONS 3
static button_info_t buttons[NUM_BUTTONS];

// === UI structure: all LVGL objects live here ===============================

typedef struct {
    lv_obj_t *root;                  // main container

    lv_obj_t *question_label;
    lv_obj_t *answer_labels[3];
    lv_obj_t *countdown_label;
    lv_obj_t *reaction_label;
    lv_obj_t *score_label;
    lv_obj_t *fail_instr_label;

    lv_obj_t *answer_frames[3];
    lv_obj_t *buttons[3];            // LVGL button widgets

