esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
    lv_obj_t *center_label;          // used for winner/fail/shutdown screens
} quiz_ui_t;

static quiz_ui_t ui = {0};

// === Helper: Difficulty to time ============================================

static int get_timer_duration(char difficulty)
{
    switch (difficulty) {
    case 'L': return 15;
    case 'M': return 30;
    case 'H': return 45;
    default:  return 30;
    }
}

// === Question selection =====================================================

static void init_quiz_logic(void)
{
    score = 0;
    tries = 0;
    memset(used_questions, 0, sizeof(used_questions));
    current_question_index = -1;
    timer_remaining = 0;
    user_answer = 0;

    // random seed
    srand((unsigned)esp_random());
}

static int select_random_question(void)
{
    int available = 0;
    for (int i = 0; i < NUM_QUIZ_QUESTIONS; i++) {
        if (!used_questions[i]) available++;
    }

    if (available == 0) return -1;

    int target = rand() % available;
    int count = 0;
    for (int i = 0; i < NUM_QUIZ_QUESTIONS; i++) {
        if (!used_questions[i]) {
            if (count == target) {
                used_questions[i] = true;
                return i;
            }
            count++;
        }
    }
    return -1;
}

// === UI creation & update functions (no deletes!) ===========================

static void create_quiz_ui_once(void)
{
    if (ui.root) {
        // Already created
        return;
    }

    lv_obj_t *scr = lv_scr_act();
    lv_obj_set_style_bg_color(scr, LV_COLOR_WHITE, LV_PART_MAIN);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLL_CHAIN_HOR);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLL_CHAIN_VER);

    // Root container for all quiz elements
    ui.root = lv_obj_create(scr);
    lv_obj_set_size(ui.root, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_bg_color(ui.root, LV_COLOR_WHITE, LV_PART_MAIN);
    lv_obj_clear_flag(ui.root, LV_OBJ_FLAG_SCROLLABLE);

    // QUESTION BOX (framed, centered)
    ui.question_label = lv_label_create(ui.root);
    lv_obj_set_width(ui.question_label, 700);
    lv_label_set_long_mode(ui.question_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_font(ui.question_label, &lv_font_montserrat_24, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.question_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_set_style_text_align(ui.question_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);

    // Frame styling
    lv_obj_set_style_bg_color(ui.question_label, WWTBAM_BLUE_DARK, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(ui.question_label, LV_OPA_80, LV_PART_MAIN);
    lv_obj_set_style_border_color(ui.question_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_obj_set_style_border_width(ui.question_label, 2, LV_PART_MAIN);
    lv_obj_set_style_radius(ui.question_label, 16, LV_PART_MAIN);
    lv_obj_set_style_pad_all(ui.question_label, 20, LV_PART_MAIN);

    lv_obj_align(ui.question_label, LV_ALIGN_TOP_MID, 0, 20);

    // Score label (top-left)
    ui.score_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.score_label, &lv_font_montserrat_16, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.score_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_align(ui.score_label, LV_ALIGN_TOP_LEFT, 10, 10);

    // Countdown label (bottom middle)
    ui.countdown_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.countdown_label, &lv_font_montserrat_18, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.countdown_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_obj_align(ui.countdown_label, LV_ALIGN_BOTTOM_LEFT, 10, -10);

    // Reaction label (center)
    ui.reaction_label = lv_label_create(ui.root);
    lv_obj_set_style_text_align(ui.reaction_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(ui.reaction_label, &lv_font_montserrat_18, LV_PART_MAIN);
    lv_label_set_long_mode(ui.reaction_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(ui.reaction_label, 600);
    lv_obj_align(ui.reaction_label, LV_ALIGN_BOTTOM_MID, 0, -10);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);

    // Central label for winner/fail/shutdown screens
    ui.center_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.center_label, &lv_font_montserrat_24, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.center_label, LV_COLOR_WHITE, LV_PART_MAIN);
    lv_obj_align(ui.center_label, LV_ALIGN_CENTER, 0, 0);
    lv_obj_add_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);

    // Additional label for fail instructions (only used in FAIL state)
    ui.fail_instr_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.fail_instr_label, &lv_font_montserrat_16, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.fail_instr_label, LV_COLOR_WHITE, LV_PART_MAIN);
    lv_obj_align(ui.fail_instr_label, LV_ALIGN_BOTTOM_MID, 0, -20);
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Create LVGL button widgets (3 buttons)
    const int frame_width = 700;
    const int frame_height = 80;
    const int spacing = 20;

    for (int i = 0; i < 3; i++) {

        // Outer frame (button + text)
        ui.answer_frames[i] = lv_obj_create(ui.root);
        lv_obj_set_size(ui.answer_frames[i], frame_width, frame_height);
        lv_obj_align(ui.answer_frames[i], LV_ALIGN_CENTER, 0, (i - 1) * (frame_height + spacing));

        lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_BLUE_DARK, LV_PART_MAIN);
        lv_obj_set_style_bg_opa(ui.answer_frames[i], LV_OPA_80, LV_PART_MAIN);
        lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_border_width(ui.answer_frames[i], 2, LV_PART_MAIN);
        lv_obj_set_style_radius(ui.answer_frames[i], 16, LV_PART_MAIN);
        lv_obj_set_style_pad_all(ui.answer_frames[i], 10, LV_PART_MAIN);

        // BUTTON inside the frame
        ui.buttons[i] = lv_button_create(ui.answer_frames[i]);
        lv_obj_set_size(ui.buttons[i], 120, 60);
        lv_obj_align(ui.buttons[i], LV_ALIGN_LEFT_MID, 0, 0);

        lv_color_t btn_color =
            (i == 0) ? WWTBAM_BLUE :
            (i == 1) ? WWTBAM_GREEN_DARK :
                    LV_COLOR_RED;

        lv_obj_set_style_bg_color(ui.buttons[i], btn_color, LV_PART_MAIN);
        lv_obj_set_style_border_color(ui.buttons[i], WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_border_width(ui.buttons[i], 1, LV_PART_MAIN);
        lv_obj_set_style_radius(ui.buttons[i], 12, LV_PART_MAIN);

        // Letter label (A/B/C)
        lv_obj_t *letter = lv_label_create(ui.buttons[i]);
        lv_label_set_text(letter, (i == 0) ? "A" : (i == 1) ? "B" : "C");
        lv_obj_set_style_text_color(letter, WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_text_font(letter, &lv_font_montserrat_20, LV_PART_MAIN);
        lv_obj_center(letter);

