esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
        // Answer text OUTSIDE the button, inside the frame
        ui.answer_labels[i] = lv_label_create(ui.answer_frames[i]);
        lv_obj_set_style_text_color(ui.answer_labels[i], WWTBAM_WHITE, LV_PART_MAIN);
        lv_obj_set_style_text_font(ui.answer_labels[i], &lv_font_montserrat_18, LV_PART_MAIN);
        lv_obj_align(ui.answer_labels[i], LV_ALIGN_LEFT_MID, 150, 0);
    }

}

static void highlight_answer_frame(int index)
{
    for (int i = 0; i < 3; i++) {
        if (i == index) {
            // Selected frame
            lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_HIGHLIGHT_BG, LV_PART_MAIN);
            lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_HIGHLIGHT_BORDER, LV_PART_MAIN);
            lv_obj_set_style_border_width(ui.answer_frames[i], 5, LV_PART_MAIN);
        } else {
            // Reset others
            lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_BLUE_DARK, LV_PART_MAIN);
            lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_GOLD, LV_PART_MAIN);
            lv_obj_set_style_border_width(ui.answer_frames[i], 2, LV_PART_MAIN);
        }
    }
}

static void update_score_display(void)
{
    if (!ui.score_label) return;
    char buf[32];
    snprintf(buf, sizeof(buf), "Punkte: %d", score);
    lv_label_set_text(ui.score_label, buf);
}

static void update_countdown_display(void)
{
    if (!ui.countdown_label) return;
    char buf[32];
    snprintf(buf, sizeof(buf), "Zeit: %d", timer_remaining);
    lv_label_set_text(ui.countdown_label, buf);
}

static void show_question_ui(int q_index)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BG, LV_PART_MAIN);

    lv_obj_clear_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);

    highlight_answer_frame(-1);  // reset highlights 

    for (int i = 0; i < 3; i++) {
        lv_obj_clear_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }

    lv_label_set_text(ui.question_label, quiz_questions[q_index].question);

    lv_label_set_text(ui.answer_labels[0], quiz_questions[q_index].answer_a);
    lv_label_set_text(ui.answer_labels[1], quiz_questions[q_index].answer_b);
    lv_label_set_text(ui.answer_labels[2], quiz_questions[q_index].answer_c);

    update_score_display();

    timer_remaining = get_timer_duration(quiz_questions[q_index].difficulty);
    update_countdown_display();
}

static void show_reaction_ui(bool correct)
{
    if (!ui.reaction_label) return;

    const char *reaction = correct ?
                           quiz_questions[current_question_index].correct_reaction :
                           quiz_questions[current_question_index].wrong_reaction;

    lv_label_set_text(ui.reaction_label, reaction);
    lv_obj_set_style_text_color(ui.reaction_label,
                                correct ? LV_COLOR_GREEN : LV_COLOR_RED,
                                LV_PART_MAIN);

    lv_obj_clear_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
}

static void show_winner_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BLUE, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Show center label
    lv_obj_clear_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.center_label, "Congratulations!\nYou won the quiz!");
}

static void show_fail_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, LV_COLOR_RED, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }

    // Show center + instruction
    lv_obj_clear_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.center_label, "Game Over!\nTry again?");

    lv_obj_clear_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.fail_instr_label, "Green: Restart\nLong Red: Shutdown");
}

static void show_shutdown_prompt_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_ORANGE_DARK, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Show center label
    lv_obj_clear_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.center_label, "Press any button to shutdown");
}

// === Quiz timer callback (only uses LVGL safely, no deletes) ================

static void quiz_timer_callback(lv_timer_t *timer)
{
    static int second_counter = 0;
    static int winner_counter = 0;
    static int fail_counter = 0;

    second_counter++;

    switch (quiz_state) {
    case QUIZ_STATE_SHOWING_QUESTION: {
        current_question_index = select_random_question();
        if (current_question_index == -1) {
            // All questions used
            if (score >= 10) {
                quiz_state = QUIZ_STATE_WINNER;
                winner_counter = 0;
                show_winner_ui();
                lv_timer_set_period(quiz_timer, 100);  // 100 ms for winner timer
            } else {
                quiz_state = QUIZ_STATE_FAIL;
                fail_counter = 0;
                show_fail_ui();
                lv_timer_set_period(quiz_timer, 100);  // 100 ms for fail timer
            }
            second_counter = 0;
            break;
        }

        // Show a new question
        show_question_ui(current_question_index);
        quiz_state = QUIZ_STATE_WAITING_ANSWER;
        lv_timer_set_period(quiz_timer, 1000); // 1 second for countdown
        second_counter = 0;
        break;
    }

