esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
    case QUIZ_STATE_WAITING_ANSWER:
        if (second_counter >= 1) {
            timer_remaining--;
            update_countdown_display();
            second_counter = 0;

            if (timer_remaining < 0) {
                // Time's up
                quiz_state = QUIZ_STATE_SHOWING_REACTION;
                bool correct = false;
                if (score > 0) score--;
                tries++;
                update_score_display();
                show_reaction_ui(correct);
                lv_timer_set_period(quiz_timer, 3000); // show reaction 3 sec
                second_counter = 0;
            }
        }
        break;

    case QUIZ_STATE_SHOWING_REACTION:
        if (second_counter >= 3) {
            if (score >= 10) {
                quiz_state = QUIZ_STATE_WINNER;
                winner_counter = 0;
                show_winner_ui();
                lv_timer_set_period(quiz_timer, 100);
            } else if (tries >= 20) {
                quiz_state = QUIZ_STATE_FAIL;
                fail_counter = 0;
                show_fail_ui();
                lv_timer_set_period(quiz_timer, 100);
            } else {
                quiz_state = QUIZ_STATE_SHOWING_QUESTION;
                lv_timer_set_period(quiz_timer, 100);
            }
            second_counter = 0;
        }
        break;

    case QUIZ_STATE_WINNER:
        winner_counter++;
        if (winner_counter >= 150) {  // 15 seconds
            quiz_state = QUIZ_STATE_SHUTDOWN_PROMPT;
            show_shutdown_prompt_ui();
            winner_counter = 0;
        }
        break;

    case QUIZ_STATE_FAIL:
        fail_counter++;
        if (fail_counter >= 50) {  // 5 seconds
            // Refresh fail screen occasionally (optional)
            show_fail_ui();
            fail_counter = 0;
        }
        break;

    case QUIZ_STATE_SHUTDOWN_PROMPT:
    case QUIZ_STATE_IDLE:
    default:
        // nothing
        break;
    }
}

// === Answer handling in LVGL context via lv_async_call =======================

static void handle_answer_async(void *user_data)
{
    int btn_index = (int)user_data;

    if (quiz_state != QUIZ_STATE_WAITING_ANSWER) {
        return;
    }

    user_answer = 'A' + btn_index;
    highlight_answer_frame(btn_index);

    bool correct = (user_answer == quiz_questions[current_question_index].correct);
    if (correct) {
        score++;
    } else {
        if (score > 0) score--;
    }
    tries++;
    update_score_display();

    quiz_state = QUIZ_STATE_SHOWING_REACTION;
    show_reaction_ui(correct);
    lv_timer_set_period(quiz_timer, 3000); // 3 seconds reaction
}

// === Shutdown or restart from LVGL context ==================================

static void handle_restart_async(void *user_data)
{
    (void)user_data;

    init_quiz_logic();
    quiz_state = QUIZ_STATE_SHOWING_QUESTION;
    lv_timer_set_period(quiz_timer, 100);
}

static void handle_shutdown_async(void *user_data)
{
    (void)user_data;
    esp_restart();
}

// === Button event callback (no direct LVGL calls, only lv_async_call) ========

static void button_event_cb(void *arg, void *data)
{
    button_handle_t btn_handle = (button_handle_t)arg;
    button_event_t event = iot_button_get_event(btn_handle);

    int btn_index = -1;
    for (int i = 0; i < NUM_BUTTONS; i++) {
        if (buttons[i].handle == btn_handle) {
            btn_index = i;
            break;
        }
    }

    if (btn_index == -1) {
        ESP_LOGE("BUTTON", "Unknown button handle");
        return;
    }

    const char *color_names[] = {"BLUE", "GREEN", "RED"};
    ESP_LOGI("BUTTON", "%s button event: %s",
             color_names[btn_index], iot_button_get_event_str(event));

    if (BUTTON_PRESS_REPEAT == event || BUTTON_PRESS_REPEAT_DONE == event) {
        ESP_LOGI("BUTTON", "\tREPEAT[%d]", iot_button_get_repeat(btn_handle));
    }

    if (BUTTON_PRESS_UP == event || BUTTON_LONG_PRESS_HOLD == event || BUTTON_LONG_PRESS_UP == event) {
        ESP_LOGI("BUTTON", "\tPressed Time[%" PRIu32 " ms]", iot_button_get_pressed_time(btn_handle));
    }

    if (BUTTON_MULTIPLE_CLICK == event) {
        ESP_LOGI("BUTTON", "\tMULTIPLE[%d]", (int)data);
    }

    // Visual button state
    if (BUTTON_PRESS_DOWN == event) {
        buttons[btn_index].is_pressed = true;
    } else if (BUTTON_PRESS_UP == event || BUTTON_PRESS_END == event) {
        buttons[btn_index].is_pressed = false;

        // Quiz logic (through async handlers)
        if (quiz_state == QUIZ_STATE_WAITING_ANSWER) {
            lv_async_call(handle_answer_async, (void *)btn_index);
        } else if (quiz_state == QUIZ_STATE_SHUTDOWN_PROMPT) {
            // Any button shuts down
            lv_async_call(handle_shutdown_async, NULL);
        } else if (quiz_state == QUIZ_STATE_FAIL) {
            uint32_t pressed_ms = iot_button_get_pressed_time(btn_handle);
            if (btn_index == 1) { // Green button - restart
                lv_async_call(handle_restart_async, NULL);
            } else if (btn_index == 2 && pressed_ms > 2000) { // Long red press - shutdown
                lv_async_call(handle_shutdown_async, NULL);
            }
        }
    }
}

// === Start quiz =============================================================

static void start_quiz(void)
{
    init_quiz_logic();
    quiz_state = QUIZ_STATE_SHOWING_QUESTION;
    if (!quiz_timer) {
        quiz_timer = lv_timer_create(quiz_timer_callback, 100, NULL);
    } else {
        lv_timer_reset(quiz_timer);
        lv_timer_set_period(quiz_timer, 100);
    }
}

// === app_main ===============================================================

void app_main(void)
{
    // Initialize logical button configurations
    buttons[0] = (button_info_t){ .gpio_num = 2, .color = LV_COLOR_BLUE,  .btn_obj = NULL, .handle = NULL, .is_pressed = false };
    buttons[1] = (button_info_t){ .gpio_num = 3, .color = LV_COLOR_GREEN, .btn_obj = NULL, .handle = NULL, .is_pressed = false };
    buttons[2] = (button_info_t){ .gpio_num = 4, .color = LV_COLOR_RED,   .btn_obj = NULL, .handle = NULL, .is_pressed = false };

    // Initialize display
    bsp_display_cfg_t cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = BSP_LCD_DRAW_BUFF_SIZE,
        .double_buffer = BSP_LCD_DRAW_BUFF_DOUBLE,
        .flags = {
            .buff_dma = true,
            .buff_spiram = false,
            .sw_rotate = false,
        }
    };

    bsp_display_start_with_config(&cfg);
    bsp_display_backlight_on();

    // Create UI once
    create_quiz_ui_once();

    // Initialize physical buttons
    const button_config_t btn_cfg = {0};
    const char *color_names[] = {"BLUE", "GREEN", "RED"};

    for (int i = 0; i < NUM_BUTTONS; i++) {
        const button_gpio_config_t btn_gpio_cfg = {
            .gpio_num = buttons[i].gpio_num,
            .active_level = 0,  // Active low
        };

